run/flowthermal/FTL-Lesson11/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

2
(
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          4800;
        startFace       57600;
    }
    internalFaces
    {
        type            internal;
        inGroups        List<word> 1(internal);
        nFaces          0;
        startFace       62400;
    }
)

// ************************************************************************* //
